# Renaming Column Names

In [1]:
df1=data.frame(State=c('Arizona','Georgia', 'Newyork','Indiana','seattle','washington','Texas'),
               code=c('AZ','GA','NY','IN','ST','WT','TX'),
               Score=c(62,47,55,74,31,77,85))
df1

  State      code Score
1 Arizona    AZ   62
2 Georgia    GA   47
3 Newyork    NY   55
4 Indiana    IN   74
5 seattle    ST   31
6 washington WT   77
7 Texas      TX   85

### Rename all the column in R:

In [2]:
# rename all the column in R

colnames(df1) <- c("State_Name", "State_code","Hindex_Score")
df1

  State_Name State_code Hindex_Score
1 Arizona    AZ         62
2 Georgia    GA         47
3 Newyork    NY         55
4 Indiana    IN         74
5 seattle    ST         31
6 washington WT         77
7 Texas      TX         85

### Rename a specific column in R – Method 1:

In [3]:
# rename a specific column in R

names(df1)[1]<-"US_State_Name"
df1

  US_State_Name State_code Hindex_Score
1 Arizona       AZ         62
2 Georgia       GA         47
3 Newyork       NY         55
4 Indiana       IN         74
5 seattle       ST         31
6 washington    WT         77
7 Texas         TX         85

### Rename a specific column in R – Method 2:

In [4]:
# rename a specific column in R

names(df1)[names(df1) == "State"] <- "US_State_Name" 
df1

  US_State_Name State_code Hindex_Score
1 Arizona       AZ         62
2 Georgia       GA         47
3 Newyork       NY         55
4 Indiana       IN         74
5 seattle       ST         31
6 washington    WT         77
7 Texas         TX         85

# CONVERT TO TITLE CASE IN R DATAFRAME COLUMN

In [5]:
df1 = data.frame(State = c('Arizona AZ','Georgia GG', 'Newyork NY','Indiana IN','Florida FL'), 
                 Score=c(62,47,55,74,31))
df1

  State      Score
1 Arizona AZ 62
2 Georgia GG 47
3 Newyork NY 55
4 Indiana IN 74
5 Florida FL 31

### Convert to title case or proper case in R dataframe:

In [6]:
library(stringr)
df1$state_title_case = str_to_title(df1$State)
df1

  State      Score state_title_case
1 Arizona AZ 62    Arizona Az
2 Georgia GG 47    Georgia Gg
3 Newyork NY 55    Newyork Ny
4 Indiana IN 74    Indiana In
5 Florida FL 31    Florida Fl

### CONVERT COLUMN TO CATEGORICAL IN R

In [7]:
df1 = data.frame(Name = c('George','Andrea', 'Micheal','Maggie','Ravi','Xien','Jalpa'), 
                 Mathematics_score=c(45,78,34,89,66,72,87),
                 IS_PASS=c(0,1,0,1,1,1,1))
df1

  Name    Mathematics_score IS_PASS
1 George  45                0
2 Andrea  78                1
3 Micheal 34                0
4 Maggie  89                1
5 Ravi    66                1
6 Xien    72                1
7 Jalpa   87                1

In [11]:
df1$IS_PASS = as.factor(df1$IS_PASS) # converting to categorical
head(df1)
str(df1)

  Name    Mathematics_score IS_PASS
1 George  45                0
2 Andrea  78                1
3 Micheal 34                0
4 Maggie  89                1
5 Ravi    66                1
6 Xien    72                1

'data.frame':	7 obs. of  3 variables:
 $ Name             : Factor w/ 7 levels "Andrea","George",..: 2 1 5 4 6 7 3
 $ Mathematics_score: num  45 78 34 89 66 72 87
 $ IS_PASS          : Factor w/ 2 levels "0","1": 1 2 1 2 2 2 2

### PERCENTAGE OF THE COLUMN IN R

In [12]:
df1 = data.frame(State = c('Arizona AZ','Georgia GG', 'Newyork NY','Indiana IN','Florida FL'), Score=c(62,47,55,74,31))
df1

  State      Score
1 Arizona AZ 62
2 Georgia GG 47
3 Newyork NY 55
4 Indiana IN 74
5 Florida FL 31

In [13]:
df1$score_percen= 100*(df1$Score/sum(df1$Score))
df1

  State      Score score_percen
1 Arizona AZ 62    23.04833
2 Georgia GG 47    17.47212
3 Newyork NY 55    20.44610
4 Indiana IN 74    27.50929
5 Florida FL 31    11.52416

### REVERSE THE COLUMN ORDER OF THE DATAFRAME IN R

In [14]:
df1 = data.frame( Name = c('George','Andrea', 'Micheal','Maggie','Ravi','Xien','Jalpa'), 
                  Grade_score=c(4,6,2,9,5,7,8),
                  Mathematics1_score=c(45,78,44,89,66,49,72),
                  Science_score=c(56,52,45,88,33,90,47))

In [15]:
## invert the column order in R

df2=df1[,order(ncol(df1):1)]
df2

  Science_score Mathematics1_score Grade_score Name
1 56            45                 4           George
2 52            78                 6           Andrea
3 45            44                 2           Micheal
4 88            89                 9           Maggie
5 33            66                 5           Ravi
6 90            49                 7           Xien
7 47            72                 8           Jalpa

#### FILTERING WITH MULTIPLE CONDITIONS IN R

In [1]:
### Create Data Frame
df1 = data.frame(Name = c('George','Andrea', 'Micheal','Maggie','Ravi','Xien','Jalpa'), 
                 Grade_score=c(4,6,2,9,5,7,8),
                 Mathematics1_score=c(45,78,44,89,66,49,72),
                 Science_score=c(56,52,45,88,33,90,47))
df1

  Name    Grade_score Mathematics1_score Science_score
1 George  4           45                 56
2 Andrea  6           78                 52
3 Micheal 2           44                 45
4 Maggie  9           89                 88
5 Ravi    5           66                 33
6 Xien    7           49                 90
7 Jalpa   8           72                 47

In [17]:
library(dplyr)
result_or <- df1 %>% filter(Mathematics1_score>45 | Science_score>45)
result_or

Warning message:
"package 'dplyr' was built under R version 3.6.3"
Attaching package: 'dplyr'

The following objects are masked from 'package:stats':

    filter, lag

The following objects are masked from 'package:base':

    intersect, setdiff, setequal, union

  Name   Grade_score Mathematics1_score Science_score
1 George 4           45                 56
2 Andrea 6           78                 52
3 Maggie 9           89                 88
4 Ravi   5           66                 33
5 Xien   7           49                 90
6 Jalpa  8           72                 47

In [4]:
library(dplyr)
result_and <- df1 %>% filter(Mathematics1_score>45 & Science_score>45)
result_and

  Name   Grade_score Mathematics1_score Science_score
1 Andrea 6           78                 52
2 Maggie 9           89                 88
3 Xien   7           49                 90
4 Jalpa  8           72                 47

In [6]:
library(dplyr)
result_and <- df1 %>% filter(Mathematics1_score>45 & Science_score>45 & Grade_score > 6 & Name == "Maggie")
result_and

  Name   Grade_score Mathematics1_score Science_score
1 Maggie 9           89                 88

In [7]:
df <- read.csv('Dataset/state.csv')

In [8]:
head(df)

  State      Population Murder.Rate Abbreviation
1 Alabama     4779736   5.7         AL
2 Alaska       710231   5.6         AK
3 Arizona     6392017   4.7         AZ
4 Arkansas    2915918   5.6         AR
5 California 37253956   4.4         CA
6 Colorado    5029196   2.8         CO

In [11]:
res <- df %>% filter(Population <=2915918 & Murder.Rate > 5.0)
head(res)

  State    Population Murder.Rate Abbreviation
1 Alaska    710231    5.6         AK
2 Arkansas 2915918    5.6         AR
3 Delaware  897934    5.8         DE
4 Nevada   2700551    6.0         NV

In [31]:
result <- df %>% filter(State == "Alaska")

In [32]:
result

  State  Population Murder.Rate Abbreviation
1 Alaska 710231     5.6         AK

In [33]:
result <- df %>% filter(State == "Alaska ")

In [34]:
result

     State Population Murder.Rate Abbreviation

In [35]:
result <- df %>% filter(State == "Alaska" & Abbreviation == "AK")

In [36]:
result

  State  Population Murder.Rate Abbreviation
1 Alaska 710231     5.6         AK